blerf.org
#+hugo_base_dir: ./
#+hugo_section: words

#+seq_todo: TODO DRAFT DONE

#+property: header-args :eval never-export
#+options: creator:t

#+STARTUP: indent
#+STARTUP: logdone

#+AUTHOR: Sam Pillsworth

** DONE Batch 'em up, Move 'em on :fs2:
CLOSED: [2024-08-28 Wed 14:22]
:PROPERTIES:
:EXPORT_FILE_NAME: batch-it
:END:

I really like working with fs2. I like saving little code examples for myself. I
want to use the blog more and get out of the habit of reaching for gists. Also I need somewhere to put my intrusive-thought song parodies[fn:6].

*** The Problem
We have a stream of "things". We want to batch those things up, and do something
to each batch. We need to count which batch we're on. Oh and also, if the stream
of "things" is empty, we want to fallback to some other operation.
*** The Code
#+begin_src scala
import cats.effect.IO
import fs2.Stream

def getAndProcessThings(batchSize: Int): IO[Unit] = {
  val things: Stream[IO, String] = Stream("a", "b", "c", "d", "e", "f", "g", "h", "i", "j").covary[IO]
  val fallback: Stream[IO, Unit] = Stream.eval(IO.println("falling back"))

  things
    .chunkN(batchSize) // split stream into chunks of batchSize
    .zipWithIndex // zip the chunks together with an index
    .evalMap { case (chunk, batchNumber) =>
      IO.println(s"Processing batch $batchNumber: $chunk")
    }
    .ifEmpty(fallback)
    .compile
    .drain
}
#+end_src

If that function is run with a batch size of 3, we'll get the following output
#+begin_src shell
processing batch number 0; Chunk(a, b, c)
processing batch number 1; Chunk(d, e, f)
processing batch number 2; Chunk(g, h, i)
processing batch number 3; Chunk(j)
#+end_src

If ~things~ was instead set to a value of ~Stream.empty~, we'll instead see ~falling back~ printed.
